Repository: acesoftware365/ezinvoicepro
Catalog: lib/l10n/app/app_*.arb
Languages: ar, es, hi, ru

# loginSubtitle
source: Create your account
ar: أنشئ حسابك
es: Crea tu cuenta
hi: अपना अकाउंट बनाएं
ru: Создайте аккаунт

source: Email
ar: البريد الإلكتروني
hi: ईमेल

source: Password
ar: كلمة المرور
es: Contraseña
hi: पासवर्ड
ru: Пароль

source: Login
ar: تسجيل الدخول
es: Iniciar sesión
hi: लॉगिन
ru: Войти

# register
source: Create account
ar: إنشاء حساب
es: Crear cuenta
hi: अकाउंट बनाएं
ru: Создать аккаунт

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟
es: ¿Ya tienes una cuenta?
hi: क्या आपके पास पहले से अकाउंट है?
ru: Уже есть аккаунт?

source: Sign in
ar: تسجيل الدخول
es: Iniciar sesión
hi: साइन इन
ru: Войти

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
es: ¿No tienes una cuenta?
hi: क्या आपका अकाउंट नहीं है?
ru: Нет аккаунта?

source: Sign up
ar: إنشاء حساب
es: Registrarse
hi: साइन अप
ru: Зарегистрироваться

source: Processing...
ar: جارٍ المعالجة...
es: Procesando...
hi: प्रोसेस हो रहा है...
ru: Обработка...

# invalidCredentials
source: Enter a valid email and password (6+ characters)
ar: أدخل بريدًا إلكترونيًا صحيحًا وكلمة مرور (6+ أحرف)
es: Ingresa un email válido y contraseña (6+ caracteres)
hi: एक वैध ईमेल और पासवर्ड दर्ज करें (6+ अक्षर)
ru: Введите корректный email и пароль (6+ символов)

# authError
source: Authentication error
ar: خطأ في المصادقة
es: Error de autenticación
hi: ऑथेंटिकेशन त्रुटि
ru: Ошибка аутентификации

source: Home
ar: الرئيسية
es: Inicio
hi: होम
ru: Главная

source: Clients
ar: العملاء
es: Clientes
hi: क्लाइंट्स
ru: Клиенты

source: Invoices
ar: الفواتير
es: Facturas
hi: इनवॉइस
ru: Счета

source: Reports
ar: التقارير
es: Reportes
hi: रिपोर्ट्स
ru: Отчёты

source: Settings
ar: الإعدادات
es: Ajustes
hi: सेटिंग्स
ru: Настройки

source: Log out
ar: تسجيل الخروج
es: Cerrar sesión
hi: लॉग आउट
ru: Выйти

source: Business
ar: النشاط التجاري
es: Negocio
hi: बिज़नेस
ru: Бизнес

# settingsLanguage
source: Language
ar: اللغة
es: Idioma
hi: भाषा
ru: Язык

# settingsLanguageDescription
source: Choose the language for the app.
ar: اختر لغة التطبيق.
es: Elige el idioma de la app.
hi: ऐप की भाषा चुनें।
ru: Выберите язык приложения.

source: System default
ar: لغة النظام
es: Predeterminado del sistema
hi: सिस्टम डिफ़ॉल्ट
ru: Язык системы

source: Privacy Policy
ar: سياسة الخصوصية
es: Política de privacidad
hi: प्राइवेसी पॉलिसी
ru: Политика конфиденциальности

# clientMessageTemplateMultiline
source: Hi {name}, sending your invoice from EzInvoice. ✅
ar: مرحبًا {name}, أرسل لك فاتورتك من EzInvoice. ✅
es: Hola {name}, te envío tu factura desde EzInvoice. ✅
hi: Hi {name}, EzInvoice से आपका इनवॉइस भेज रहा हूँ। ✅
ru: Привет, {name}! Отправляю ваш счёт из EzInvoice. ✅

# invoiceEmailSubject
source: Invoice - EzInvoice
ar: فاتورة - EzInvoice
es: Factura - EzInvoice
ru: Счёт - EzInvoice

# dashboardTitle
source: Dashboard
ar: لوحة التحكم
es: Panel
hi: डैशबोर्ड
ru: Панель

# monthWord
source: Month
ar: الشهر
es: Mes
hi: महीना
ru: Месяц

# planLabel
source: Plan
ar: الخطة
hi: प्लान
ru: Тариф

source: Invoices remaining
ar: الفواتير المتبقية
es: Facturas restantes
hi: बचे हुए इनवॉइस
ru: Осталось счетов

# proUnlimitedLabel
source: PRO · Unlimited
ar: PRO · غير محدود
es: PRO · Ilimitado
hi: PRO · अनलिमिटेड
ru: PRO · Безлимит

source: Create new invoice
ar: إنشاء فاتورة جديدة
es: Crear nueva factura
hi: नया इनवॉइस बनाएं
ru: Создать новый счёт

# limitReachedSubtitle
source: Limit reached • Upgrade to Pro
ar: تم الوصول للحد • قم بالترقية إلى Pro
es: Límite alcanzado • Actualiza a Pro
hi: लिमिट पूरी • Pro में अपग्रेड करें
ru: Лимит достигнут • Перейдите на Pro

# createInvoiceFastSubtitle
source: Create invoice + PDF in seconds
ar: أنشئ فاتورة + PDF خلال ثوانٍ
es: Crea factura + PDF en segundos
hi: सेकंडों में इनवॉइस + PDF बनाएं
ru: Создайте счёт + PDF за секунды

# limitReachedTitle
source: Limit reached
ar: تم الوصول للحد
es: Límite alcanzado
hi: लिमिट पूरी हो गई
ru: Лимит достигнут

# limitReachedBody
source: Upgrade to Pro for unlimited invoices and remove ads.
ar: قم بالترقية إلى Pro لفواتير غير محدودة وإزالة الإعلانات.
es: Actualiza a Pro para facturas ilimitadas y eliminar anuncios.
hi: अनलिमिटेड इनवॉइस और विज्ञापन हटाने के लिए Pro में अपग्रेड करें।
ru: Перейдите на Pro для безлимитных счетов и удаления рекламы.

source: Upgrade
ar: ترقية
es: Actualizar
hi: अपग्रेड
ru: Перейти на Pro

# monthSummaryTitle
source: Month summary
ar: ملخص الشهر
es: Resumen del mes
hi: महीने का सारांश
ru: Итоги месяца

# salesTitle
source: Sales
ar: المبيعات
es: Ventas
hi: सेल्स
ru: Продажи

# tipTitle
source: Tip
ar: الإكرامية
es: Propina
hi: टिप
ru: Чаевые

# subtotalTitle
source: Subtotal
ar: المجموع الفرعي
hi: सबटोटल
ru: Подытог

# taxTitle
source: Tax
ar: الضريبة
es: Impuesto
hi: टैक्स
ru: Налог

source: Before tax/tip
ar: قبل الضريبة/الإكرامية
es: Antes de impuesto/propina
hi: टैक्स/टिप से पहले
ru: До налога/чаевых

source: Collected this month
ar: المحصّل هذا الشهر
es: Cobrado este mes
hi: इस महीने कलेक्ट किया
ru: Собрано в этом месяце

# quickAccessTitle
source: Quick access
ar: وصول سريع
es: Acceso rápido
hi: क्विक एक्सेस
ru: Быстрый доступ

# clientsManageSubtitle
source: Create / edit clients
ar: إنشاء / تعديل العملاء
es: Crear / editar clientes
hi: क्लाइंट बनाएं / एडिट करें
ru: Создать / редактировать клиентов

# invoicesViewSendSubtitle
source: View and send PDF
ar: عرض وإرسال PDF
es: Ver y enviar PDF
hi: PDF देखें और भेजें
ru: Просмотр и отправка PDF

# monthlyYearlySubtitle
source: Monthly / yearly
ar: شهري / سنوي
es: Mensual / anual
hi: मासिक / वार्षिक
ru: Месячный / годовой

# businessProfileSubtitle
source: Profile / logo / tax
ar: الملف / الشعار / الضريبة
es: Perfil / logo / impuesto
hi: प्रोफाइल / लोगो / टैक्स
ru: Профиль / логотип / налог

# invoiceCount
source: {count} invoice(s)
ar: {count} فاتورة
es: {count} factura(s)
hi: {count} इनवॉइस
ru: {count} счёт(ов)

source: Close
ar: إغلاق
es: Cerrar
hi: बंद करें
ru: Закрыть

# paywallHeaderTitle
source: Unlock everything for your business
ar: افتح كل شيء لعملك
es: Desbloquea todo para tu negocio
hi: अपने बिज़नेस के लिए सब कुछ अनलॉक करें
ru: Откройте всё для вашего бизнеса

# paywallHeaderSubtitle
source: No ads • Unlimited invoices • Tax reports • Premium templates
ar: بدون إعلانات • فواتير غير محدودة • تقارير ضرائب • قوالب مميزة
es: Sin anuncios • Facturas ilimitadas • Reportes de impuestos • Plantillas premium
hi: कोई विज्ञापन नहीं • अनलिमिटेड इनवॉइस • टैक्स रिपोर्ट्स • प्रीमियम टेम्पलेट्स
ru: Без рекламы • Безлимитные счета • Налоговые отчёты • Премиум-шаблоны

source: Best value
ar: أفضل قيمة
es: Mejor opción
hi: सबसे बढ़िया
ru: Лучшее предложение

source: Pro Yearly
ar: Pro سنوي
es: Pro anual
hi: Pro वार्षिक
ru: Pro на год

# saveMoreYearly
source: Save more by paying yearly
ar: وفّر أكثر بالدفع سنويًا
es: Ahorra más pagando anual
hi: सालाना भुगतान पर अधिक बचत
ru: Экономьте, оплачивая раз в год

source: Pro Monthly
ar: Pro شهري
es: Pro mensual
hi: Pro मासिक
ru: Pro на месяц

source: Flexible
ar: مرن
hi: लचीला
ru: Гибко

source: Cancel anytime
ar: إلغاء في أي وقت
es: Cancela cuando quieras
hi: कभी भी कैंसिल करें
ru: Отмена в любое время

source: Processing purchase…
ar: جارٍ معالجة الشراء…
es: Procesando compra…
hi: खरीद प्रोसेस हो रही है…
ru: Обрабатываем покупку…

source: Restoring purchases…
ar: جارٍ استعادة المشتريات…
es: Restaurando compras…
hi: खरीदें रिस्टोर हो रही हैं…
ru: Восстанавливаем покупки…

source: Restore purchases
ar: استعادة المشتريات
es: Restaurar compras
hi: खरीदें रिस्टोर करें
ru: Восстановить покупки

# continueFreeWithAds
source: Continue with free version with Ads
ar: المتابعة بالنسخة المجانية مع الإعلانات
es: Continuar con versión gratis con anuncios
hi: विज्ञापनों के साथ फ्री वर्ज़न जारी रखें
ru: Продолжить бесплатно с рекламой

# alreadyProTitle
source: You are Pro ✅
ar: أنت Pro ✅
es: Eres Pro ✅
hi: आप Pro हैं ✅
ru: У вас Pro ✅

# alreadyProBody
source: Enjoy unlimited invoices, reports, and no ads.
ar: استمتع بفواتير غير محدودة، تقارير، وبدون إعلانات.
es: Disfruta facturas ilimitadas, reportes y sin anuncios.
hi: अनलिमिटेड इनवॉइस, रिपोर्ट्स और बिना विज्ञापन का आनंद लें।
ru: Наслаждайтесь безлимитными счетами, отчётами и без рекламы.

# continueText
source: Continue
ar: متابعة
es: Continuar
hi: जारी रखें
ru: Продолжить

# includesInPro
source: Included in Pro
ar: يتضمن Pro
es: Incluido en Pro
hi: Pro में शामिल
ru: В Pro включено

# benefitNoAds
source: No ads (Banner/Interstitial/Rewarded)
ar: بدون إعلانات (Banner/Interstitial/Rewarded)
es: Sin anuncios (Banner/Interstitial/Rewarded)
hi: कोई विज्ञापन नहीं (Banner/Interstitial/Rewarded)
ru: Без рекламы (баннер/интерстициал/вознаграждение)

# benefitUnlimitedInvoices
source: Unlimited invoices + statuses (draft/sent/paid)
ar: فواتير غير محدودة + حالات (مسودة/مرسلة/مدفوعة)
es: Facturas ilimitadas + estados (borrador/enviada/pagada)
hi: अनलिमिटेड इनवॉइस + स्टेटस (ड्राफ्ट/सेंट/पेड)
ru: Безлимитные счета + статусы (черновик/отправлен/оплачен)

# benefitPremiumTemplates
source: Premium templates + colors + business logo
ar: قوالب مميزة + ألوان + شعار النشاط
es: Plantillas premium + colores + logo del negocio
hi: प्रीमियम टेम्पलेट्स + रंग + बिज़नेस लोगो
ru: Премиум-шаблоны + цвета + логотип бизнеса

# benefitNoWatermarkPdf
source: Professional PDF without watermark
ar: PDF احترافي بدون علامة مائية
es: PDF profesional sin marca de agua
hi: वॉटरमार्क के बिना प्रोफेशनल PDF
ru: Профессиональный PDF без водяного знака

# benefitTaxReports
source: Tax reports: monthly and yearly (taxes/tips/net)
ar: تقارير ضرائب: شهري وسنوي (ضرائب/إكرامية/صافي)
es: Reportes de impuestos: mensual y anual (impuestos/propinas/neto)
hi: टैक्स रिपोर्ट्स: मासिक और वार्षिक (टैक्स/टिप/नेट)
ru: Налоговые отчёты: месячные и годовые (налоги/чаевые/итого)

# benefitExport
source: Export PDF/CSV/Excel (for accounting)
ar: تصدير PDF/CSV/Excel (للمحاسبة)
es: Exportar PDF/CSV/Excel (contabilidad)
hi: PDF/CSV/Excel एक्सपोर्ट (अकाउंटिंग के लिए)
ru: Экспорт PDF/CSV/Excel (для бухгалтерии)

# benefitCloudBackup
source: Cloud backup + restore (multi-device)
ar: نسخ احتياطي سحابي + استعادة (أجهزة متعددة)
es: Respaldo en la nube + restaurar (multi-dispositivo)
hi: क्लाउड बैकअप + रिस्टोर (मल्टी-डिवाइस)
ru: Облачный бэкап + восстановление (несколько устройств)

source: Continue with {plan}
ar: متابعة مع {plan}
es: Continuar con {plan}
hi: {plan} के साथ जारी रखें
ru: Продолжить с {plan}

# paywallFinePrint
source: By subscribing, payment will be charged to your {store} account. The subscription renews automatically unless you cancel at least 24 hours before the end of the current period. You can manage or cancel your subscription in your store settings.
ar: بالاشتراك، سيتم خصم الدفع من حساب {store} الخاص بك. يتجدد الاشتراك تلقائيًا ما لم تقم بالإلغاء قبل 24 ساعة على الأقل من نهاية الفترة الحالية. يمكنك إدارة اشتراكك أو إلغاؤه من إعدادات المتجر.
es: Al suscribirte, el pago se cargará a tu cuenta de {store}. La suscripción se renueva automáticamente a menos que la canceles al menos 24 horas antes de que termine el período actual. Puedes administrar o cancelar tu suscripción en la configuración de tu tienda.
hi: सब्सक्राइब करने पर भुगतान आपके {store} अकाउंट से लिया जाएगा। सब्सक्रिप्शन अपने आप रिन्यू होता है जब तक कि आप वर्तमान अवधि खत्म होने से कम से कम 24 घंटे पहले कैंसिल न करें। आप स्टोर सेटिंग्स में सब्सक्रिप्शन मैनेज या कैंसिल कर सकते हैं।
ru: При подписке оплата будет списана с вашего аккаунта {store}. Подписка автоматически продлевается, если вы не отмените её минимум за 24 часа до окончания текущего периода. Управлять подпиской или отменить её можно в настройках магазина.

# reportsTitle
source: Reports
ar: التقارير
es: Reportes
hi: रिपोर्ट्स
ru: Отчёты

source: By month
ar: حسب الشهر
es: Por mes
hi: महीने के अनुसार
ru: По месяцам

source: By year
ar: حسب السنة
es: Por año
hi: साल के अनुसार
ru: По годам

# monthLabel
source: Month
ar: الشهر
es: Mes
hi: महीना
ru: Месяц

# yearLabel
source: Year
ar: السنة
es: Año
hi: साल
ru: Год

# businessProfileTitle
source: Business Profile
ar: ملف النشاط
es: Perfil del negocio
hi: बिज़नेस प्रोफाइल
ru: Профиль бизнеса

source: Save
ar: حفظ
es: Guardar
hi: सेव करें
ru: Сохранить

source: Upload logo
ar: رفع الشعار
es: Subir logo
hi: लोगो अपलोड करें
ru: Загрузить логотип

source: Remove
ar: إزالة
es: Quitar
hi: हटाएं
ru: Удалить

# businessNameLabel
source: Business name
ar: اسم النشاط
es: Nombre del negocio
hi: बिज़नेस नाम
ru: Название бизнеса

# ownerNameLabel
source: Owner / contact name
ar: المالك / اسم جهة الاتصال
es: Dueño / contacto
hi: ओनर / कॉन्टैक्ट नाम
ru: Владелец / контактное лицо

# phoneLabel
source: Phone
ar: الهاتف
es: Teléfono
hi: फ़ोन
ru: Телефон

# addressLabel
source: Address
ar: العنوان
es: Dirección
hi: पता
ru: Адрес

# currencyLabel
source: Currency
ar: العملة
es: Moneda
hi: मुद्रा
ru: Валюта

# taxDefaultLabel
source: Default tax (%)
ar: الضريبة الافتراضية (%)
es: Impuesto predeterminado (%)
hi: डिफ़ॉल्ट टैक्स (%)
ru: Налог по умолчанию (%)

source: Invalid number
ar: رقم غير صالح
es: Número inválido
hi: अमान्य संख्या
ru: Неверное число

# range0to100
source: Must be between 0 and 100
ar: يجب أن يكون بين 0 و 100
es: Debe estar entre 0 y 100
hi: 0 से 100 के बीच होना चाहिए
ru: Должно быть от 0 до 100

# requiredField
source: Required
ar: مطلوب
es: Requerido
hi: आवश्यक
ru: Обязательно

# footerNoteLabel
source: Footer note (PDF)
ar: ملاحظة التذييل (PDF)
es: Nota al pie (PDF)
hi: फुटर नोट (PDF)
ru: Примечание внизу (PDF)

source: Save changes
ar: حفظ التغييرات
es: Guardar cambios
hi: परिवर्तन सेव करें
ru: Сохранить изменения

# businessFooterDefault
source: Thank you for your business.
ar: شكرًا لتعاملكم معنا.
es: Gracias por su preferencia.
hi: आपके बिज़नेस के लिए धन्यवाद।
ru: Спасибо за ваш бизнес.

# businessSavedSuccess
source: Business profile saved successfully
ar: تم حفظ ملف النشاط بنجاح
es: Perfil del negocio guardado correctamente
hi: बिज़नेस प्रोफाइल सफलतापूर्वक सेव हुआ
ru: Профиль бизнеса успешно сохранён

# businessInfoSection
source: Business information
ar: معلومات النشاط
es: Información del negocio
hi: बिज़नेस जानकारी
ru: Информация о бизнесе

# settingsSection
source: Settings
ar: الإعدادات
es: Ajustes
hi: सेटिंग्स
ru: Настройки

# footerSection
source: Footer note (PDF)
ar: ملاحظة التذييل (PDF)
es: Nota al pie (PDF)
hi: फुटर नोट (PDF)
ru: Примечание внизу (PDF)

source: Upgrade to Pro
ar: ترقية إلى Pro
es: Actualizar a Pro
hi: Pro में अपग्रेड करें
ru: Перейти на Pro

# bestValueStar
source: ⭐ Best value
ar: ⭐ أفضل قيمة
es: ⭐ Mejor opción
hi: ⭐ सबसे बढ़िया
ru: ⭐ Лучшее предложение

# invoicesTitle
source: Invoices
ar: الفواتير
es: Facturas
hi: इनवॉइस
ru: Счета

source: No invoices yet.
ar: لا توجد فواتير بعد.
es: Aún no hay facturas.
hi: अभी कोई इनवॉइस नहीं।
ru: Пока нет счетов.

# freePlanMonthlyLimitBanner
source: Free plan: monthly limit {limit} invoices • Upgrade for unlimited
ar: الخطة المجانية: حد شهري {limit} فاتورة • ترقية لغير محدود
es: Plan gratis: límite mensual {limit} facturas • Actualiza para ilimitadas
hi: फ्री प्लान: मासिक सीमा {limit} इनवॉइस • अनलिमिटेड के लिए अपग्रेड
ru: Бесплатный план: месячный лимит {limit} счетов • Перейдите на безлимит

# filtersTitle
source: Filters
ar: الفلاتر
es: Filtros
hi: फ़िल्टर
ru: Фильтры

# clientLabel
source: Client
ar: العميل
es: Cliente
hi: क्लाइंट
ru: Клиент

source: All months
ar: كل الأشهر
es: Todos los meses
hi: सभी महीने
ru: Все месяцы

source: All clients
ar: كل العملاء
es: Todos los clientes
hi: सभी क्लाइंट
ru: Все клиенты

source: Clear
ar: مسح
es: Limpiar
hi: क्लियर
ru: Очистить

# invoicesSummaryLabel
source: Invoices
ar: الفواتير
es: Facturas
hi: इनवॉइस
ru: Счета

# totalTitle
source: Total
ar: الإجمالي
hi: कुल
ru: Итого

# dateLabel
source: Date
ar: التاريخ
es: Fecha
hi: तारीख
ru: Дата

# noResultsForFilters
source: No results for selected filters.
ar: لا توجد نتائج للفلاتر المحددة.
es: No hay resultados para los filtros seleccionados.
hi: चुने हुए फ़िल्टर के लिए कोई परिणाम नहीं।
ru: Нет результатов для выбранных фильтров.

# freePlanLimitDialogBody
source: Free plan: {current} / {limit} invoices this month. Upgrade to Pro for unlimited.
ar: الخطة المجانية: {current} / {limit} فواتير هذا الشهر. قم بالترقية إلى Pro لغير محدود.
es: Plan gratis: {current} / {limit} facturas este mes. Actualiza a Pro para ilimitadas.
hi: फ्री प्लान: {current} / {limit} इनवॉइस इस महीने। अनलिमिटेड के लिए Pro में अपग्रेड करें।
ru: Бесплатный план: {current} / {limit} счетов в этом месяце. Перейдите на Pro для безлимита.

# deleteInvoiceTitle
source: Delete invoice?
ar: حذف الفاتورة؟
es: ¿Eliminar factura?
hi: इनवॉइस हटाएं?
ru: Удалить счёт?

# deleteInvoiceBody
source: Are you sure you want to delete {invNo}?
ar: هل أنت متأكد أنك تريد حذف {invNo}؟
es: ¿Seguro que quieres eliminar {invNo}?
hi: क्या आप वाकई {invNo} हटाना चाहते हैं?
ru: Вы уверены, что хотите удалить {invNo}?

source: Cancel
ar: إلغاء
es: Cancelar
hi: रद्द करें
ru: Отмена

source: Delete
ar: حذف
es: Eliminar
hi: हटाएं
ru: Удалить

source: Edit
ar: تعديل
es: Editar
hi: एडिट
ru: Редактировать

source: Send PDF
ar: إرسال PDF
es: Enviar PDF
hi: PDF भेजें
ru: Отправить PDF

# shareInvoiceText
source: Invoice {invNo} - {client}
ar: فاتورة {invNo} - {client}
es: Factura {invNo} - {client}
hi: इनवॉइस {invNo} - {client}
ru: Счёт {invNo} - {client}

# pdfSendError
source: Error creating/sending PDF: {error}
ar: خطأ في إنشاء/إرسال PDF: {error}
es: Error al crear/enviar PDF: {error}
hi: PDF बनाने/भेजने में त्रुटि: {error}
ru: Ошибка создания/отправки PDF: {error}

# reportTitleMonth
source: Report • {month} {year}
ar: تقرير • {month} {year}
es: Reporte • {month} {year}
hi: रिपोर्ट • {month} {year}
ru: Отчёт • {month} {year}

# reportTitleYear
source: Report • Year {year}
ar: تقرير • سنة {year}
es: Reporte • Año {year}
hi: रिपोर्ट • वर्ष {year}
ru: Отчёт • Год {year}

# invoicesLine
source: Invoices: {count}
ar: الفواتير: {count}
es: Facturas: {count}
hi: इनवॉइस: {count}
ru: Счета: {count}

# totalSalesLine
source: Total Sales: ${amount}
ar: إجمالي المبيعات: ${amount}
es: Ventas totales: ${amount}
hi: कुल सेल्स: ${amount}
ru: Общие продажи: ${amount}

# totalTaxLine
source: Total Tax: ${amount}
ar: إجمالي الضريبة: ${amount}
es: Impuesto total: ${amount}
hi: कुल टैक्स: ${amount}
ru: Общий налог: ${amount}

# totalTipLine
source: Total Tip: ${amount}
ar: إجمالي الإكرامية: ${amount}
es: Propina total: ${amount}
hi: कुल टिप: ${amount}
ru: Общие чаевые: ${amount}

# netLine
source: Net: ${amount}
ar: الصافي: ${amount}
es: Neto: ${amount}
hi: नेट: ${amount}
ru: Итого (net): ${amount}

# calculatedFromInvoices
source: Calculated from your invoices in Firestore.
ar: تم الحساب من فواتيرك في Firestore.
es: Calculado desde tus facturas en Firestore.
hi: Firestore में आपके इनवॉइस से गणना की गई।
ru: Рассчитано на основе ваших счетов в Firestore.

# noInvoicesInPeriod
source: No invoices in that period.
ar: لا توجد فواتير في هذه الفترة.
es: No hay facturas en ese período.
hi: उस अवधि में कोई इनवॉइस नहीं।
ru: В этом периоде нет счетов.

source: Export PDF
ar: تصدير PDF
es: Exportar PDF
hi: PDF एक्सपोर्ट
ru: Экспорт PDF

source: Export CSV
ar: تصدير CSV
es: Exportar CSV
hi: CSV एक्सपोर्ट
ru: Экспорт CSV

# yearlyProReason
source: Yearly report is PRO. Upgrade to unlock it.
ar: التقرير السنوي PRO. قم بالترقية لفتحه.
es: El reporte anual es PRO. Actualiza para desbloquearlo.
hi: वार्षिक रिपोर्ट PRO है। अनलॉक करने के लिए अपग्रेड करें।
ru: Годовой отчёт — PRO. Перейдите на Pro, чтобы открыть.

# exportPdfProReason
source: Exporting report PDF is PRO.
ar: تصدير PDF للتقرير هو PRO.
es: Exportar el PDF del reporte es PRO.
hi: रिपोर्ट PDF एक्सपोर्ट PRO है।
ru: Экспорт PDF отчёта — PRO.

# exportCsvProReason
source: Exporting CSV is PRO.
ar: تصدير CSV هو PRO.
es: Exportar CSV es PRO.
hi: CSV एक्सपोर्ट PRO है।
ru: Экспорт CSV — PRO.

source: No data to export.
ar: لا توجد بيانات للتصدير.
es: No hay datos para exportar.
hi: एक्सपोर्ट करने के लिए कोई डेटा नहीं।
ru: Нет данных для экспорта.

# freePlanReportsNote
source: Free plan: monthly reports only. Upgrade for yearly reports and export.
ar: الخطة المجانية: تقارير شهرية فقط. قم بالترقية للتقارير السنوية والتصدير.
es: Plan gratis: solo reportes mensuales. Actualiza para reportes anuales y exportar.
hi: फ्री प्लान: केवल मासिक रिपोर्ट्स। वार्षिक रिपोर्ट्स और एक्सपोर्ट के लिए अपग्रेड करें।
ru: Бесплатный план: только месячные отчёты. Перейдите на Pro для годовых отчётов и экспорта.

# genericError
source: Something went wrong. Try again.
ar: حدث خطأ ما. حاول مرة أخرى.
es: Algo salió mal. Intenta de nuevo.
hi: कुछ गलत हो गया। फिर से कोशिश करें।
ru: Что-то пошло не так. Попробуйте ещё раз.

# newInvoiceTitle
source: New Invoice
ar: فاتورة جديدة
es: Nueva factura
hi: नया इनवॉइस
ru: Новый счёт

# editInvoiceTitle
source: Edit Invoice
ar: تعديل الفاتورة
es: Editar factura
hi: इनवॉइस एडिट करें
ru: Редактировать счёт

source: Pick client
ar: اختر عميلًا
es: Elegir cliente
hi: क्लाइंट चुनें
ru: Выбрать клиента

# invoiceAutoNumberLabel
source: Invoice # (auto)
ar: رقم الفاتورة (تلقائي)
es: Factura # (auto)
hi: इनवॉइस # (ऑटो)
ru: Счёт # (авто)

# invoiceDateLabel
source: Invoice date: {date}
ar: تاريخ الفاتورة: {date}
es: Fecha de factura: {date}
hi: इनवॉइस तारीख: {date}
ru: Дата счёта: {date}

# clientNameLabel
source: Client name
ar: اسم العميل
es: Nombre del cliente
hi: क्लाइंट नाम
ru: Имя клиента

source: Client name required
ar: اسم العميل مطلوب
es: Nombre del cliente requerido
hi: क्लाइंट नाम आवश्यक है
ru: Имя клиента обязательно

# clientEmailOptionalLabel
source: Client email (optional)
ar: بريد العميل (اختياري)
es: Email del cliente (opcional)
hi: क्लाइंट ईमेल (वैकल्पिक)
ru: Email клиента (необязательно)

# clientPhoneOptionalLabel
source: Client phone (optional)
ar: هاتف العميل (اختياري)
es: Teléfono del cliente (opcional)
hi: क्लाइंट फ़ोन (वैकल्पिक)
ru: Телефон клиента (необязательно)

source: Invalid email format
ar: تنسيق بريد غير صالح
es: Formato de email inválido
hi: अमान्य ईमेल फ़ॉर्मेट
ru: Неверный формат email

# itemsTitle
source: Items
ar: العناصر
hi: आइटम्स
ru: Позиции

# descriptionLabel
source: Description
ar: الوصف
es: Descripción
hi: विवरण
ru: Описание

# itemDateLabel
source: Item date: {date}
ar: تاريخ العنصر: {date}
es: Fecha del item: {date}
hi: आइटम तारीख: {date}
ru: Дата позиции: {date}

# qtyLabel
source: Qty
ar: الكمية
es: Cant.
hi: मात्रा
ru: Кол-во

# priceLabel
source: Price
ar: السعر
es: Precio
hi: कीमत
ru: Цена

# lineTotalLabel
source: Line total: ${amount}
ar: إجمالي السطر: ${amount}
es: Total de línea: ${amount}
hi: लाइन टोटल: ${amount}
ru: Итого по строке: ${amount}

# taxDefaultOwnerLabel
source: Tax % (default owner)
ar: الضريبة % (افتراضي المالك)
es: Impuesto % (dueño predeterminado)
hi: टैक्स % (डिफ़ॉल्ट ओनर)
ru: Налог % (по умолчанию)

# tipPercentChip
source: Tip %
ar: إكرامية %
es: Propina %
hi: टिप %
ru: Чаевые %

# tipAmountChip
source: Tip $
ar: إكرامية $
es: Propina $
hi: टिप $
ru: Чаевые $

# tipPercentLabel
source: Tip percent (%)
ar: نسبة الإكرامية (%)
es: Porcentaje de propina (%)
hi: टिप प्रतिशत (%)
ru: Процент чаевых (%)

# tipAmountLabel
source: Tip amount ($)
ar: قيمة الإكرامية ($)
es: Monto de propina ($)
hi: टिप राशि ($)
ru: Сумма чаевых ($)

# messageOptionalLabel
source: Message (optional)
ar: رسالة (اختياري)
es: Mensaje (opcional)
hi: मैसेज (वैकल्पिक)
ru: Сообщение (необязательно)

# totalsBlock
source: Subtotal: ${sub} Tax: ${tax} Tip: ${tip} Total: ${total}
ar: المجموع الفرعي: ${sub} الضريبة: ${tax} الإكرامية: ${tip} الإجمالي: ${total}
es: Subtotal: ${sub} Impuesto: ${tax} Propina: ${tip} Total: ${total}
hi: सबटोटल: ${sub} टैक्स: ${tax} टिप: ${tip} टोटल: ${total}
ru: Подытог: ${sub} Налог: ${tax} Чаевые: ${tip} Итого: ${total}

source: Saving…
ar: جارٍ الحفظ…
es: Guardando…
hi: सेव हो रहा है…
ru: Сохранение…

source: Save invoice
ar: حفظ الفاتورة
es: Guardar factura
hi: इनवॉइस सेव करें
ru: Сохранить счёт

source: Update invoice
ar: تحديث الفاتورة
es: Actualizar factura
hi: इनवॉइस अपडेट करें
ru: Обновить счёт
