Repository: acesoftware365/ezinvoicepro
Catalog: lib/l10n/app/app_*.arb
Languages: ar, es, hi, ru

# addAtLeastOneItem
source: Add at least 1 item
ar: أضف عنصرًا واحدًا على الأقل
es: Agrega al menos 1 item
hi: कम से कम 1 आइटम जोड़ें
ru: Добавьте минимум 1 позицию

# errorSavingInvoice
source: Error saving invoice: {error}
ar: خطأ في حفظ الفاتورة: {error}
es: Error al guardar factura: {error}
hi: इनवॉइस सेव करने में त्रुटि: {error}
ru: Ошибка сохранения счёта: {error}

# savedTab
source: Saved
ar: المحفوظة
es: Guardados
hi: सेव्ड
ru: Сохранённые

# contactsTab
source: Contacts
ar: جهات الاتصال
es: Contactos
hi: कॉन्टैक्ट्स
ru: Контакты

source: No saved clients
ar: لا توجد عملاء محفوظون
es: No hay clientes guardados
hi: कोई सेव्ड क्लाइंट नहीं
ru: Нет сохранённых клиентов

source: Permission denied: Contacts
ar: تم رفض الإذن: جهات الاتصال
es: Permiso denegado: Contactos
hi: परमिशन डिनाइड: कॉन्टैक्ट्स
ru: Доступ к контактам запрещён

# noContactsFound
source: No contacts found on this device/emulator
ar: لا توجد جهات اتصال على هذا الجهاز/المحاكي
es: No se encontraron contactos en este dispositivo/emulador
hi: इस डिवाइस/एमुलेटर पर कोई कॉन्टैक्ट नहीं मिला
ru: Контакты не найдены на этом устройстве/эмуляторе

# contactsError
source: Contacts error: {error}
ar: خطأ جهات الاتصال: {error}
es: Error de contactos: {error}
hi: कॉन्टैक्ट त्रुटि: {error}
ru: Ошибка контактов: {error}

source: (No name)
ar: (بدون اسم)
es: (Sin nombre)
hi: (कोई नाम नहीं)
ru: (Без имени)

# newClientTitle
source: New client
ar: عميل جديد
es: Nuevo cliente
hi: नया क्लाइंट
ru: Новый клиент

# editClientTitle
source: Edit client
ar: تعديل العميل
es: Editar cliente
hi: क्लाइंट एडिट करें
ru: Редактировать клиента

# clientInfoSection
source: Client information
ar: معلومات العميل
es: Información del cliente
hi: क्लाइंट जानकारी
ru: Информация о клиенте

# notesLabel
source: Notes
ar: ملاحظات
es: Notas
hi: नोट्स
ru: Заметки

# notesHint
source: Add notes (optional)
ar: أضف ملاحظات (اختياري)
es: Agregar notas (opcional)
hi: नोट्स जोड़ें (वैकल्पिक)
ru: Добавьте заметки (необязательно)

# clientCreateHint
source: Tip: Add email/phone to send invoices faster.
ar: نصيحة: أضف البريد/الهاتف لإرسال الفواتير أسرع.
es: Tip: Agrega email/teléfono para enviar facturas más rápido.
hi: टिप: तेज़ी से इनवॉइस भेजने के लिए ईमेल/फ़ोन जोड़ें।
ru: Совет: добавьте email/телефон, чтобы быстрее отправлять счета.

# clientEditHint
source: You can update client info anytime.
ar: يمكنك تحديث معلومات العميل في أي وقت.
es: Puedes actualizar la info del cliente cuando quieras.
hi: आप कभी भी क्लाइंट जानकारी अपडेट कर सकते हैं।
ru: Вы можете обновлять данные клиента в любое время.

# errorSavingClient
source: Error saving client: {error}
ar: خطأ في حفظ العميل: {error}
es: Error al guardar cliente: {error}
hi: क्लाइंट सेव करने में त्रुटि: {error}
ru: Ошибка сохранения клиента: {error}

# clientsTitle
source: Clients
ar: العملاء
es: Clientes
hi: क्लाइंट्स
ru: Клиенты

# searchClientsLabel
source: Search clients
ar: بحث عن العملاء
es: Buscar clientes
hi: क्लाइंट खोजें
ru: Поиск клиентов

# clientsCount
source: {count} client(s)
ar: {count} عميل
es: {count} cliente(s)
hi: {count} क्लाइंट
ru: {count} клиент(ов)

source: No clients yet.
ar: لا يوجد عملاء بعد.
es: Aún no hay clientes.
hi: अभी कोई क्लाइंट नहीं।
ru: Пока нет клиентов.

# noClientsForSearch
source: No clients match your search.
ar: لا يوجد عملاء مطابقون للبحث.
es: No hay clientes que coincidan con tu búsqueda.
hi: आपकी खोज से कोई क्लाइंट मेल नहीं खाता।
ru: Нет клиентов, подходящих под поиск.

source: Cannot open dialer
ar: لا يمكن فتح لوحة الاتصال
es: No se puede abrir el marcador
hi: डायलर नहीं खुल सका
ru: Не удалось открыть набор номера

source: Cannot open SMS
ar: لا يمكن فتح الرسائل
es: No se puede abrir SMS
hi: SMS नहीं खुल सका
ru: Не удалось открыть SMS

source: WhatsApp not available
ar: واتساب غير متاح
es: WhatsApp no está disponible
hi: WhatsApp उपलब्ध नहीं
ru: WhatsApp недоступен

source: Cannot open email
ar: لا يمكن فتح البريد الإلكتروني
es: No se puede abrir email
hi: ईमेल नहीं खुल सका
ru: Не удалось открыть email

# deleteClientTitle
source: Delete client?
ar: حذف العميل؟
es: ¿Eliminar cliente?
hi: क्लाइंट हटाएं?
ru: Удалить клиента?

# deleteClientBody
source: Remove {name}?
ar: إزالة {name}؟
es: ¿Quitar a {name}?
hi: {name} हटाएं?
ru: Удалить {name}?

source: Call
ar: اتصال
es: Llamar
hi: कॉल
ru: Позвонить

# emailAction
source: Email
ar: البريد
hi: ईमेल

# shareAppTitle
source: Try EzInvoice 👇
ar: جرّب EzInvoice 👇
es: Prueba EzInvoice 👇
hi: EzInvoice आज़माएं 👇
ru: Попробуйте EzInvoice 👇

# shareAppBody
source: Create invoices, send PDFs, and track reports easily.
ar: أنشئ فواتير، أرسل PDFs، وتابع التقارير بسهولة.
es: Crea facturas, envía PDFs y controla reportes fácilmente.
hi: इनवॉइस बनाएं, PDFs भेजें, और रिपोर्ट्स आसानी से ट्रैक करें।
ru: Создавайте счета, отправляйте PDF и легко отслеживайте отчёты.

# shareAppTooltip
source: Share app
ar: مشاركة التطبيق
es: Compartir app
hi: ऐप शेयर करें
ru: Поделиться приложением

# openGooglePlayTooltip
source: Open Google Play
ar: فتح Google Play
es: Abrir Google Play
hi: Google Play खोलें
ru: Открыть Google Play

# openAppStoreTooltip
source: Open App Store
ar: فتح App Store
es: Abrir App Store
hi: App Store खोलें
ru: Открыть App Store

# openWebsiteTooltip
source: Open website
ar: فتح الموقع
es: Abrir sitio web
hi: वेबसाइट खोलें
ru: Открыть сайт

source: Available languages
ar: اللغات المتاحة
es: Idiomas disponibles
hi: उपलब्ध भाषाएँ
ru: Доступные языки

# usePhoneLanguage
source: Use your phone language
ar: استخدام لغة الهاتف
es: Usar el idioma del teléfono
hi: फोन की भाषा उपयोग करें
ru: Использовать язык телефона

# shareReceiptText
source: Receipt {invoiceNumber} for {clientName}
ar: إيصال {invoiceNumber} لـ {clientName}
es: Recibo {invoiceNumber} para {clientName}
hi: रसीद {invoiceNumber} — {clientName} के लिए
ru: Квитанция {invoiceNumber} для {clientName}

source: Report
ar: تقرير
es: Reporte
hi: रिपोर्ट
ru: Отчёт

# invoicesLabel
source: Invoices
ar: الفواتير
es: Facturas
hi: इनवॉइस
ru: Счета

# totalSalesLabel
source: Total Sales
ar: إجمالي المبيعات
es: Ventas totales
hi: कुल सेल्स
ru: Общие продажи

# totalTaxLabel
source: Total Tax
ar: إجمالي الضريبة
es: Impuesto total
hi: कुल टैक्स
ru: Общий налог

# totalTipLabel
source: Total Tip
ar: إجمالي الإكرامية
es: Propina total
hi: कुल टिप
ru: Общие чаевые

# netLabel
source: Net
ar: الصافي
es: Neto
hi: नेट

# sentLabel
source: Sent
ar: مرسلة
es: Enviadas
hi: सेंट
ru: Отправлено

# paidLabel
source: Paid
ar: مدفوعة
es: Pagadas
hi: पेड
ru: Оплачено

# overdueLabel
source: Overdue
ar: متأخرة
es: Vencidas
hi: ओवरड्यू
ru: Просрочено

# reportCalculatedHint
source: Calculated from your invoices in Firestore.
ar: تم الحساب من فواتيرك في Firestore.
es: Calculado desde tus facturas en Firestore.
hi: Firestore में आपके इनवॉइस से गणना की गई।
ru: Рассчитано на основе ваших счетов в Firestore.

source: Export PDF (coming soon)
ar: تصدير PDF (قريبًا)
es: Exportar PDF (pronto)
hi: PDF एक्सपोर्ट (जल्द)
ru: Экспорт PDF (скоро)

source: Export CSV (coming soon)
ar: تصدير CSV (قريبًا)
es: Exportar CSV (pronto)
hi: CSV एक्सपोर्ट (जल्द)
ru: Экспорт CSV (скоро)

# unsentLabel
source: Unsent
ar: غير مرسلة
es: No enviadas
hi: अनसेंट
ru: Не отправлено

# deleteAccountTitle
source: Delete Account
ar: حذف الحساب
es: Eliminar cuenta
hi: アカウントを削除
ru: Удалить аккаунт

# deleteAccountWarning
source: This action will permanently delete your account and all associated data.
ar: سيؤدي هذا الإجراء إلى حذف حسابك وجميع البيانات المرتبطة به نهائيًا.
es: Esta acción eliminará permanentemente tu cuenta y todos los datos asociados.
hi: この操作を行うと、アカウントおよび関連するすべてのデータが完全に削除されます。
ru: Это действие навсегда удалит ваш аккаунт и все связанные данные.

# deleteAccountButton
source: Delete Account
ar: حذف الحساب
es: Eliminar cuenta
hi: アカウントを削除
ru: Удалить аккаунт

# deleteAccountConfirmTitle
source: Confirm Deletion
ar: تأكيد الحذف
es: Confirmar eliminación
hi: 削除の確認
ru: Подтвердить удаление

# deleteAccountConfirmMessage
source: Are you sure? This action cannot be undone.
ar: هل أنت متأكد؟ لا يمكن التراجع عن هذا الإجراء.
es: ¿Estás seguro? Esta acción no se puede deshacer.
hi: 本当に削除しますか？この操作は元に戻せません。
ru: Вы уверены? Это действие нельзя отменить.
